# 판다스의 산술연산

- 판다스 객체의 산술연산은 내부적으로 3단계 프로세스
    1. 행/열 인덱스를 기준으로 모든 원소를 정렬
    2. 동일한 위치에 있는 원소끼리 일대일로 대응
    3. 일대일 대응이 되는 원소끼리 연산 처리
        - 대응되는 원소가 없으면 NaN 처리

# 데이터프레임 연산

- 데이터프레임은 여러 시리즈가 모인 것이므로 시리즈 연산을 확장하는 개념
- 행/열 인덱스를 기준으로 정렬하고 일대일 대응되는 원소끼리 연산 처리

## 데이터프레임과 숫자 연산

- 모든 원소에 숫자를 계산

- 기존 데이터프레임의 형태를 그대로 유지한 채 원소 값만 새로운 계산으로 바뀜

- 새로운 데이터프레임 객체로 반환

In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({"A" : [1, 2, 3],
                   "B" : [4, 5, 6]})

In [5]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [6]:
df + 10

    A   B
0  11  14
1  12  15
2  13  16

In [7]:
df - 10

   A  B
0 -9 -6
1 -8 -5
2 -7 -4

In [8]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [9]:
df * 2

   A   B
0  2   8
1  4  10
2  6  12

In [10]:
df / 10

     A    B
0  0.1  0.4
1  0.2  0.5
2  0.3  0.6

## 데이터프레임과 데이터프레임의 산술 연산

- 각 데이터프레임의 같은 행, 같은 열 위치에 있는 원소끼리 계산

- 동일한 위치의 원소끼리 계산한 결과값을 원래 위치에 다시 입력하여 데이터프레임을 생성

- 데이터프레임 중 어느 한 쪽에 원소가 존재하지 않거나 NaN이면 연산 결과는 NaN 처리

In [12]:
df2 = pd.DataFrame({"A" : [10, 20, 30],
                    "B" : [40, 50, 60]})

In [14]:
df2

    A   B
0  10  40
1  20  50
2  30  60

In [15]:
df + df2

    A   B
0  11  44
1  22  55
2  33  66

In [17]:
df - df2

   A  B
0  0  0
1  0  0
2  0  0

In [18]:
df

    A   B
0  10  40
1  20  50
2  30  60

In [19]:
df = pd.DataFrame({"A" : [1, 2, 3],
                   "B" : [4, 5, 6]})

In [20]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [21]:
df2

    A   B
0  10  40
1  20  50
2  30  60

In [22]:
df - df2

    A   B
0  -9 -36
1 -18 -45
2 -27 -54

In [23]:
df * df2

    A    B
0  10  160
1  40  250
2  90  360

In [24]:
df / df2

     A    B
0  0.1  0.1
1  0.1  0.1
2  0.1  0.1

## 결측값이 있는 데이터프레임의 산술 연산

In [25]:
df1 = pd.DataFrame({"A" : [1, 2, None],
                   "B" : [4, None, 6]})
df2 = pd.DataFrame({"A" : [10, 20, 30],
                   "B" : [40, 50, 60]})

In [26]:
df1

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

In [27]:
df2

    A   B
0  10  40
1  20  50
2  30  60

In [28]:
df1 + df2

      A     B
0  11.0  44.0
1  22.0   NaN
2   NaN  66.0

In [29]:
df1 - df2

      A     B
0  -9.0 -36.0
1 -18.0   NaN
2   NaN -54.0

In [30]:
df1 * df2

      A      B
0  10.0  160.0
1  40.0    NaN
2   NaN  360.0

In [31]:
df1 / df2

     A    B
0  0.1  0.1
1  0.1  NaN
2  NaN  0.1

## 컬럼이 일치하지 않는 데이터프레임의 산술 연산

In [32]:
df3 = pd.DataFrame({"A" : [1, 2, 3],
                    "B" : [4, 5, 6]})
df4 = pd.DataFrame({"A" : [10, 20, 30],
                    "C" : [40, 50, 60]})

In [33]:
df3

   A  B
0  1  4
1  2  5
2  3  6

In [34]:
df4

    A   C
0  10  40
1  20  50
2  30  60

In [35]:
df3 + df4

    A   B   C
0  11 NaN NaN
1  22 NaN NaN
2  33 NaN NaN

In [36]:
df3 - df4

    A   B   C
0  -9 NaN NaN
1 -18 NaN NaN
2 -27 NaN NaN

In [37]:
df3 * df4

    A   B   C
0  10 NaN NaN
1  40 NaN NaN
2  90 NaN NaN

In [38]:
df3 / df4

     A   B   C
0  0.1 NaN NaN
1  0.1 NaN NaN
2  0.1 NaN NaN

## 연산 메서드

In [39]:
df1 + df2

      A     B
0  11.0  44.0
1  22.0   NaN
2   NaN  66.0

In [40]:
df1.add(df2, fill_value = 0)

      A     B
0  11.0  44.0
1  22.0  50.0
2  30.0  66.0

In [41]:
df3 + df4

    A   B   C
0  11 NaN NaN
1  22 NaN NaN
2  33 NaN NaN

In [42]:
df3.add(df4, fill_value = 0)

    A    B     C
0  11  4.0  40.0
1  22  5.0  50.0
2  33  6.0  60.0

In [43]:
df1.sub(df2, fill_value = 0)

      A     B
0  -9.0 -36.0
1 -18.0 -50.0
2 -30.0 -54.0

In [44]:
df3.sub(df4, fill_value = 0)

    A    B     C
0  -9  4.0 -40.0
1 -18  5.0 -50.0
2 -27  6.0 -60.0

In [46]:
df1.mul(df2, fill_value = 1)

      A      B
0  10.0  160.0
1  40.0   50.0
2  30.0  360.0

In [47]:
df3.mul(df4, fill_value = 1)

    A    B     C
0  10  4.0  40.0
1  40  5.0  50.0
2  90  6.0  60.0

In [48]:
df1.div(df2, fill_value = 1)

          A     B
0  0.100000  0.10
1  0.100000  0.02
2  0.033333  0.10

In [49]:
df3.div(df4, fill_value = 1)

     A    B         C
0  0.1  4.0  0.025000
1  0.1  5.0  0.020000
2  0.1  6.0  0.016667

In [50]:
df3.div(df4, fill_value = 0)

     A    B    C
0  0.1  inf  0.0
1  0.1  inf  0.0
2  0.1  inf  0.0